---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewTemplate
source: html/67b96458-a5e4-33fc-8629-50f0cbe2a25f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewTemplate Property

"View Template"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewTemplate { get; }
```